Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: A parameterized class written in Objective-C is imported into Swift as a generic class with the same number of type parameters.
ja: Objective-Cにおいて書かれたパラメータ化されたクラスは、同じ数の型パラメータを持つ総称体クラスとしスウィフトにインポートされます。

source: A partially type-erased key path, from a concrete root type to any resulting value type.
ja: ある部分的な型消去キーパス、具体的な根本の型から何らかの結果値の型への。

source: A pointer advanced from this pointer by MemoryLayout<Pointee>.stride bytes.
ja: このポインタからMemoryLayout<Pointee>.strideバイトだけ繰り上げられるポインタを返します。

source: A pointer offset from this pointer by n instances of the Pointee type.
ja: このポインタからn個のPointee型のインスタンス分だけ補われたポインタ。

source: A pointer shifted backward from this pointer by MemoryLayout<Pointee>.stride bytes.
ja: このポインタから後ろへMemoryLayout<Pointee>.strideバイトだけずらされるポインタを返します。

source: A pointer that can be used with C functions that take a va_list argument.
ja: va_list引数を取るC関数で使用できるポインタ。

source: A position in a FlattenCollection
ja: FlattenCollectionの中のある位置。

source: A positive stride iterates upward; a negative stride iterates downward.
ja: 正のstrideは上向きに反復していきます；負のstrideは下向きに反復していきます。

source: A positive value that uses the full precision of the floating-point type.
ja: 正の値、それは浮動小数点型の最大精度を使います。

source: A positive, nonzero number that does not use the full precision of the floating-point type.
ja: 正の、非ゼロの数、それは浮動小数点型の最大精度を使いません。

source: A predicate that returns true if its first argument should be ordered before its second argument; otherwise, false.
ja: ある述部、それはそれの最初の引数がそれの２番目の引数の前に並べられるべきならばtrueを返します；そうでなければ、false。

source: A predicate that returns true if its two arguments are equivalent; otherwise, false.
ja: ある述部、それはそれの２つの引数が等しいならばtrueを返します；そうでなければ、false。

source: A predicate that throws an error also never executes again.
ja: エラーをスローする述部は、同様に決して再び遂行しません。

source: A predicate used to partition the collection.
ja: コレクションに仕切りをするのに使われる述部。

source: A protocol that enables an object to be encoded and decoded for archiving and distribution.
ja: あるオブジェクトにアーカイブと配布のためにエンコードおよびデコードされることを可能にするプロトコル。

source: A protocol that enables encoding and decoding in a manner that is robust against object substitution attacks.
ja: エンコーディングとデコーディングを、オブジェクト置き換え攻撃に対して強固であるある流儀で可能にするプロトコル。

source: A quiet NaN (“not a number”).
ja: クワイエットNaN（非数）。

source: A radix-2 (binary) floating-point type.
ja: あるradix-2（バイナリ）浮動小数点型。

source: A random element from the collection.
ja: このコレクションからのある無作為の要素。

source: A random value within the bounds of range.
ja: rangeの境界内のある無作為な値。

source: A range of integers.
ja: 整数からなる範囲。

source: A range of the collection’s indices.
ja: コレクションのもつインデックスのある範囲。

source: A range suitable for slicing collection.
ja: スライスするcollectionに対して適している範囲。

source: A range to check for elements in common.
ja: 共通の要素を調べる範囲。

source: A range to compare.
ja: 比較する範囲。

source: A range-replaceable collection.
ja: 範囲置換可能なコレクション。

source: A range.
ja: 範囲。

source: A raw memory buffer.
ja: 生のメモリバッファ。

source: A raw-representable instance.
ja: 生の表現が可能なインスタンス。

source: A reference to compare.
ja: 比較する参照。

source: A removal.
ja: ある削除。

source: A representation of the substructure and display style of an instance of any type.
ja: 下位構造体の表現と何らかの型のインスタンスの表示形式。

source: A representation of this integer with the byte order swapped.
ja: この整数のバイト順交換した表現。

source: A result of yielding values.
ja: 値を生み出すことの結果。

source: A result to yield from the continuation.
ja: その継続から生まれた結果。

source: A rule for rounding a floating-point number.
ja: 浮動小数点数を丸める為のある規則。

source: A second raw-representable instance.
ja: 第２の生の表現が可能なインスタンス。

source: A sequence built around an iterator of type Base.
ja: 型Baseのイテレータに基づいて構築されるシーケンス。

source: A sequence consisting of all the elements contained in each segment contained in some Base sequence.
ja: 何らかのBaseシーケンスに含まれる各断片の中に含まれるいくらかの要素から成るシーケンス。

source: A sequence containing the same elements as this sequence, but on which some operations, such as map and filter, are implemented lazily.
ja: このシーケンスと同じ要素を含んでいるシーケンス、しかしそれの上で何らかの演算、例えばmapやfilterが遅延に実装されます。

source: A sequence from start toward, and possibly including, end.
ja: startから、そして可能なら含めて、endへ向かってのシーケンス。

source: A sequence from start toward, but not including, end.
ja: startから、そして含めずに、endへ向かってのシーケンス。

source: A sequence leaving off the specified number of elements.
ja: 指定された数の要素を取り除いたあるシーケンス。

source: A sequence of key-value pairs to use for the new dictionary.
ja: キー値ペアからなるシーケンス、新しい辞書に使うためのもの。

source: A sequence of key-value pairs.
ja: いくらかのキー値ペアからなるシーケンス

source: A sequence of pairs built out of two underlying sequences.
ja: ２つの根底にあるシーケンスから組み立てられるペアからなるシーケンス。

source: A sequence of pairs enumerating the sequence.
ja: このシーケンスを列挙している、ペアからなるあるシーケンス。

source: A sequence of the initial, consecutive elements that satisfy predicate.
ja: predicateを満たす冒頭の、隣接する要素からなるあるシーケンス。

source: A sequence of tuple pairs, where the elements of each pair are corresponding elements of sequence1 and sequence2.
ja: 対のタプルからなるシーケンス、そこにおいて各対の要素らは、sequence1とsequence2の要素に相当します。

source: A sequence of values formed by striding over a closed interval.
ja: ある完結間隔の全体をまたぐことで形成されるいくつかの値からなるシーケンス。

source: A sequence of values formed by striding over a half-open interval.
ja: ある半開間隔の全体をまたぐことで形成されるいくつかの値からなるシーケンス。

source: A sequence of values to group into a dictionary.
ja: 辞書へとグループにする幾つかの値からなるシーケンス。

source: A sequence starting after the initial, consecutive elements that satisfy predicate.
ja: predicateを満たす冒頭の、隣接する要素の後で始まるあるシーケンス。

source: A sequence starting after the specified number of elements.
ja: 指定された数の要素の後で始まるシーケンス。

source: A sequence starting at the beginning of this sequence with at most maxLength elements.
ja: このシーケンスの先端で始まる多くともmaxLength要素のあるシーケンス。

source: A sequence that can represent a contiguous subrange of the collection’s elements.
ja: コレクションの要素の隣接下位範囲を表すことのできるシーケンス。

source: A sequence that lazily consumes and drops n elements from an underlying Base iterator before possibly returning the first available element.
ja: おそらくは最初の利用可能な要素が返る前にn個の要素をある基礎をなすBaseイテレータから遅延に消費して落とすあるシーケンス。

source: A sequence that only consumes up to n elements from an underlying Base iterator.
ja: 最大でn個の要素まで基礎をなすBaseイテレータからただ消費しきるあるシーケンス。

source: A sequence that presents the elements of a base sequence of sequences concatenated using a given separator.
ja: あるシーケンス、それはいくらかのシーケンスからなるある基盤となるシーケンスの要素らを、与えられた分離子を使って連結して提示します。

source: A sequence that represents a contiguous subrange of the collection’s elements.
ja: コレクションの要素の隣接下位範囲を表すシーケンス。

source: A sequence that starts with first and continues with every value returned by passing the previous element to next.
ja: あるシーケンス、それはfirstで始まり、そして前の要素をnextに渡すことによって返される値どれもが続きます。

source: A sequence that yields each successive value from next.
ja: あるシーケンス、それはnextから連続した値各々をもたらします。

source: A sequence to compare to this sequence.
ja: あるシーケンス、このシーケンスと比べることになります。

source: A sequence to insert between each of this sequence’s elements.
ja: このシーケンスの要素それぞれの間に挿入されるシーケンス。

source: A sequence whose elements are produced via repeated applications of a closure to some mutable state.
ja: あるクロージャをある何らかの可変の状態へ繰り返し適用することでその要素が生み出されるシーケンス。

source: A sequence whose elements can be traversed multiple times, nondestructively, and accessed by an indexed subscript.
ja: あるシーケンス、それの要素は複数回探査されることが非破壊的に可能です、そしてある添え字で指し示すことによってアクセスされることが可能です。

source: A service which can execute jobs.
ja: ジョブを遂行できるあるサービス。

source: A shuffled array of this sequence’s elements.
ja: このシーケンスの持つ要素からなる、あるシャッフルされた配列。

source: A signaling NaN (“not a number”).
ja: シグナルNaN（非数）。

source: A signaling NaN sets the floating-point exception status when used in many floating-point operations.
ja: シグナルNaNは、多くの浮動小数点演算において使われる時に、浮動小数点例外状態を設定します。

source: A signed integer value type.
ja: 符号付き整数値型。

source: A signed number.
ja: 符号付きの数。

source: A signed, fixed-width integer type can represent values from -(2 ** (bitWidth - 1)) through (2 ** (bitWidth - 1)) - 1.
ja: 符号付きの、固定長整数型は、-(2 ** (bitWidth - 1))から(2 ** (bitWidth - 1)) - 1までの値を表せます。

source: A silent NaN (“not a number”) value.
ja: silent NaN（非数）値。

source: A single change to a collection.
ja: あるコレクションに対するある単一の変更。

source: A single extended grapheme cluster that approximates a user-perceived character.
ja: ある単一の拡張書記素クラスタで、１つのユーザ知覚文字におおよそ相当します。

source: A single value container view into this decoder.
ja: このデコーダへの単一コンテナビュー。

source: A single, concatenated string.
ja: 単一の、連結された文字列。

source: A single, flattened asynchronous sequence that contains all elements in all the asychronous sequences produced by transform.
ja: ある単一の、平坦にされた非同期シーケンス、それはtransformによって生み出される全ての非同期シーケンスの中の全ての要素を含みます。

source: A single-precision, floating-point value type.
ja: 単精度、浮動小数点値型。

source: A singleton actor whose executor is equivalent to the main dispatch queue.
ja: あるシングルトンアクター、それのエグゼキュータはメインディスパッチキューと同等です。

source: A slice holds a reference to the entire storage of a larger array, not just to the portion it presents, even after the original array’s lifetime ends.
ja: あるスライスは、単にそれが提示する一部分に対してではなく、より大きな配列のストレージ全体への参照を保持します、元の配列の寿命が終わった後でさえも。

source: A slice inherits the value or reference semantics of its base collection.
ja: スライスは、それの基盤コレクションのもつ値意味論もしくは参照意味論を継承します。

source: A slice of a collection can contain zero or more of the original collection’s elements and shares the original collection’s semantics.
ja: コレクションのスライスは、ゼロまたはそれ以上の元のコレクションの要素を含み、元のコレクションのもつ意味論を共有できます。

source: A slice of an Array, ContiguousArray, or ArraySlice instance.
ja: あるArray、ContiguousArray、またはArraySliceインスタンスの断片。

source: A sorted array of the sequence’s elements.
ja: このシーケンス要素のソート済み配列。

source: A specialized error that may be recoverable by presenting several potential recovery options to the user.
ja: いくつかの可能性のある回復選択肢をユーザに提示することによって回復されるかもしれないある特殊化されたエラー。

source: A specialized error that provides a domain, error code, and user-info dictionary.
ja: ある領域、エラーコード、そしてユーザ情報辞書を提供する特殊化されたエラー。

source: A specialized error that provides localized messages describing the error and why it occurred.
ja: エラーとなぜそれが起こったかを記述しているローカライズされたメッセージを提供する特殊化されたエラー。

source: A stable sort preserves the relative order of elements for which areInIncreasingOrder does not establish an order.
ja: 安定ソートは、それに対してareInIncreasingOrderが順序を確立しない要素らの相対順序を保存します。

source: A stable sort preserves the relative order of elements that compare equal.
ja: 安定ソートは、等しいと比較される要素それらの相対順序を保存します。

source: A strategy that handles exhaustion of a buffer’s capacity.
ja: ある戦略、それはあるバッファのもつ容量の枯渇を取り扱います。

source: A string identifying the declaration that is the notional source for the continuation, used to identify the continuation in runtime diagnostics related to misuse of this continuation.
ja: 継続に対する概念的ソースであるところの宣言を識別しているある文字列、この継続の誤用に関する実行時診断において継続を識別するために使われます。

source: A string representation of the Boolean value.
ja: ブール値の文字列表現。

source: A string that represents the contents of the dictionary, suitable for debugging.
ja: 辞書の内容を表す文字列、デバッグに適するもの。

source: A string that represents the contents of the dictionary.
ja: 辞書の内容を表す文字列。

source: A string to insert between each of the elements in this sequence.
ja: このシーケンスの要素のそれぞれの間に挿入されることになる文字列。

source: A string to print between each item.
ja: 各項目の間に出力する文字列。

source: A string to print if condition is evaluated to false in a playground or -Onone build.
ja: プレイグラウンドまたは-Ononeビルドにおいてconditionがfalseに評価されるならば出力する文字列。

source: A string to print if condition is evaluated to false.
ja: conditionがfalseに評価されるならば出力する文字列。

source: A string to print in a playground or -Onone build.
ja: プレイグラウンドまたは-Ononeビルドにおいて出力される文字列。

source: A subscript that provides at least read-only access to your type’s elements
ja: 少なくとも読み出し専用のアクセスをあなたの型のもつ要素に提供する添え字

source: A subsequence starting after the specified number of elements.
ja: 指定された数の要素の後から始まる下位シーケンス。

source: A subsequence starting at the start position.
ja: start位置から始まる下位シーケンス。

source: A subsequence starting at the beginning of this collection with at most maxLength elements.
ja: このコレクションの先端で始まる多くともmaxLength要素の下位シーケンス。

source: A subsequence terminating at the end of the collection with at most maxLength elements.
ja: コレクションの末端で終わっていて多くともmaxLengthの要素を持つ下位シーケンス。

source: A subsequence that leaves off k elements from the end.
ja: k個の要素を終わりから取り除いた下位シーケンス。

source: A subsequence that leaves off the specified number of elements at the end.
ja: 指定された数の要素が末尾から無くなっているシーケンス。

source: A subsequence up to, and including, the end position.
ja: end位置に至るまでの、そしてそれを含む、下位シーケンス。

source: A subsequence up to, but not including, the end position.
ja: end位置に至るまでの、しかしそれを含まないシーケンス。

source: A textual description of the vector.
ja: ベクターのテキスト記述。

source: A textual representation of the Boolean value.
ja: ブール値のテキスト表現。

source: A textual representation of the array and its elements, suitable for debugging.
ja: 配列とそれの要素のテキスト表現、デバッグに適するもの。

source: A textual representation of the array and its elements.
ja: 配列とそれの要素のテキスト表現。

source: A textual representation of the character, suitable for debugging.
ja: その文字のテキスト表現、デバッグに適するもの。

source: A textual representation of the collection, suitable for debugging.
ja: コレクションのテキスト表現、デバッグに適するもの。

source: A textual representation of the pointer, suitable for debugging.
ja: そのポインタのテキスト表現、デバッグに適するもの。

source: A textual representation of the range, suitable for debugging.
ja: 範囲のテキスト表現、デバッグに適するもの。

source: A textual representation of the range.
ja: 範囲のテキスト表現。

source: A textual representation of the value, suitable for debugging.
ja: その値のテキスト表現、デバッグに適するもの。

source: A textual representation of the value.
ja: その値のテキスト表現。

source: A textual representation of this instance, suitable for debugging.
ja: そのインスタンスのテキスト表現、デバッグに適するもの。

source: A textual representation of this instance.
ja: このインスタンスのテキスト表現。

source: A textual representation of this key, suitable for debugging.
ja: このキーのテキスト表現、デバッグに適するもの。

source: A textual representation of this key.
ja: このキーのテキスト表現。

source: A textual representation of this value.
ja: この値のテキスト表現。

source: A third value to compare.
ja: 比較する３番目の値。

source: A trivial use case producing values from a detached task would work as such:
ja: 値それらをある分離されたタスクから生み出す平凡な使用実例は、このように働くでしょう：

source: A tuple containing the high and low parts of a double-width integer.
ja: ２倍幅整数の高および低部分を含んでいるタプル。

source: A tuple containing the high and low parts of the result of multiplying this value and other.
ja: この値とotherを乗算する結果の高および低部分を含んでいるタプル。

source: A tuple containing the quotient and remainder obtained by dividing dividend by this value.
ja: dividendをこの値で除算することによって入手される商と余りを含んでいるタプル。

source: A tuple containing the quotient and remainder of dividend divided by this value.
ja: dividendをこの値で除算した商と余りを含んでいるタプル。

source: A tuple containing the quotient and remainder of this value divided by rhs.
ja: rhsによって除算されたこの値の商と余りを含んでいるタプル。

source: A tuple containing the result of the addition along with a Boolean value indicating whether overflow occurred.
ja: 加算の結果とそれだけでなくオーバーフローがその演算において起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the division along with a Boolean value indicating whether overflow occurred.
ja: 除算の結果とそれだけでなくオーバーフローがその演算において起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the multiplication along with a Boolean value indicating whether overflow occurred.
ja: 乗算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the operation along with a Boolean value indicating whether overflow occurred.
ja: 演算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple containing the result of the subtraction along with a Boolean value indicating whether overflow occurred.
ja: 減算の結果とそれだけでなくオーバーフローが起こったかどうかを示すブール値を含んでいるタプル。

source: A tuple of Comparable elements.
ja: Comparable要素からなるタプル。

source: A tuple of Equatable elements.
ja: Equatable要素のタプル。

source: A tuple of the lower and upper bounds of the range.
ja: この範囲の下方および上方境界からなるタプル。

source: A two-element tuple with the key and value corresponding to position.
ja: positionに該当するキーと値を持つ２要素タプル。

source: A type for propagating an unmanaged object reference.
ja: ある管理されないオブジェクト参照を伝達するための型。

source: A type is eligible for automatic conformance to Equatable and Hashable when it's a structure or an enumeration that meets these criteria:
ja: ある型がEquatableおよびHashableへの自動式準拠に適格であるのは、それが構造体または列挙であり、これらの基準に合う場合です：

source: A type representing an error value that can be thrown.
ja: スローされることが可能なあるエラー値を表している型。

source: A type representing continuous, one-dimensional values that can be offset and measured.
ja: オフセットできて計測できる、連続的な、一次元の値を表している型。

source: A type representing the sequence’s elements.
ja: このシーケンスの持つ要素を表している型。

source: A type representing the stable identity of the entity associated with an instance.
ja: あるインスタンスと結び付けられた登録項目の安定した同一性を表しているある型。

source: A type that asynchronously supplies the values of a sequence one at a time.
ja: ある型、それはあるシーケンスの値それらを非同期に一度に１つ提供するものです。

source: A type that can be compared for value equality.
ja: 値の同等性について比較されることができる型。

source: A type that can be compared using the relational operators <, <=, >=, and >.
ja: 関係演算子<、<=、>=、そして>を使って比較されるある型。

source: A type that can be converted to and from an associated raw value.
ja: ある結び付けられた生の値へおよびそれから変換できる型。

source: A type that can be hashed into a Hasher to produce an integer hash value.
ja: Hasherへとハッシュ化されることで整数ハッシュ値を生成することが可能な型。

source: A type that can be initialized by string interpolation with a string literal that includes expressions.
ja: いくらかの式を含むある文字列リテラルを使う文字列補間によって初期化できる型。

source: A type that can be initialized using a dictionary literal.
ja: ある辞書リテラルを使って初期化できる型。

source: A type that can be initialized using an array literal.
ja: 配列リテラルを使って初期化できる型。

source: A type that can be initialized using the nil literal, nil.
ja: nilリテラル、nilを使って初期化できる型。

source: A type that can be initialized with a floating-point literal.
ja: ある浮動小数点リテラルを使って初期化できる型。

source: A type that can be initialized with a string literal containing a single Unicode scalar value.
ja: 単一のユニコードスカラー値を含んでいるある文字列リテラルで初期化できる型。

source: A type that can be initialized with a string literal containing a single extended grapheme cluster.
ja: ただ１つの拡張書記素クラスタを含んでいるある文字列リテラルを使って初期化できる型。

source: A type that can be initialized with a string literal.
ja: ある文字列リテラルを使って初期化できる型。

source: A type that can be initialized with an integer literal.
ja: 整数リテラルで初期化できるある型。

source: A type that can be initialized with the Boolean literals true and false.
ja: ブールリテラルのtrueとfalseを使って初期化できる型。

source: A type that can be represented as a string in a lossless, unambiguous way.
ja: あるロスレスの、曖昧さのない方法で、文字列として表現できる型。

source: A type that can be used as a key for encoding and decoding.
ja: エンコーディングとデコーディングのためのキーとして使われる型。

source: A type that can convert itself into and out of an external representation.
ja: それ自身を外部表現へとそしてそれをもとに変換できる型。

source: A type that can decode itself from an external representation.
ja: それ自身が外部表現からデコードできる型。

source: A type that can decode values from a native format into in-memory representations.
ja: 値をネイティブ形式からインメモリ表現へとデコードできる型。

source: A type that can encode itself to an external representation.
ja: それ自身を外部表現へとエンコードできる型。

source: A type that can encode values into a native format for external representation.
ja: 値を外部表現のためにネイティブ形式へとエンコードできる型。

source: A type that can represent a collection of all values of this type.
ja: この型の全ての値からなるコレクションを表すことができる型。

source: A type that can represent any written exponent.
ja: 何らかの書かれた指数を表すことができる型。

source: A type that can represent both positive and negative values.
ja: 正と負の値の両方を表せる型。

source: A type that can represent the absolute value of any possible value of the conforming type.
ja: 準拠する型の何らかの可能な値の絶対値を表すことのできる型。

source: A type that can represent the absolute value of any possible value of this type.
ja: この型の何らかの可能な値の絶対値を表すことのできる型。

source: A type that conforms to the FloatingPoint protocol provides the value for pi at its best possible precision.
ja: FloatingPointプロトコルに準拠する型は、piに対する値をそれの最もよい可能な精度で提供します。

source: A type that conforms to the GlobalActor protocol and is marked with the the @globalActor attribute can be used as a custom attribute.
ja: GlobalActorプロトコルに準拠して、そして@globalActor属性で印される型は、あるあつらえの属性として使われることが可能です。

source: A type that explicitly supplies its own mirror, but whose descendant classes are not represented in the mirror unless they also override customMirror.
ja: 明示的にそれ独自のMirrorを提供するある型、しかしそれの子孫クラスはそれらがまたcustomMirrorをオーバーライドしない限りはMirrorで表現されません。

source: A type that explicitly supplies its own mirror.
ja: 明示的にそれ自身のMirrorを提供する型。

source: A type that iterates over a collection using its indices.
ja: あるコレクション全体に渡ってそれのインデックスを使って繰り返し処理する型。

source: A type that provides a collection of all of its values.
ja: それの値の全てからなるコレクションを提供する型。

source: A type that provides asynchronous, sequential, iterated access to its elements.
ja: ある型、それはそれの要素それらに対して非同期の、順次的な、反復したアクセスを提供するものです。

source: A type that provides sequential, iterated access to its elements.
ja: 順次的な、繰り返されるアクセスをそれの要素に提供するある型。

source: A type that provides the collection’s iteration interface and encapsulates its iteration state.
ja: そのコレクションの持つ反復インターフェイスを提供してそれの反復状態をカプセル化するある型。

source: A type that provides the sequence’s iteration interface and encapsulates its iteration state.
ja: そのシーケンスの持つ反復インターフェイスを提供してそれの反復状態をカプセル化するある型。

source: A type that represents a Boolean literal, such as Bool.
ja: ブールリテラルを表すある型、例えばBool。

source: A type that represents a Unicode scalar literal.
ja: ユニコードスカラーリテラルを表すある型。

source: A type that represents a floating-point literal.
ja: 浮動小数点リテラルを表すある型。

source: A type that represents a globally-unique actor that can be used to isolate various declarations anywhere in the program.
ja: ある型、それはあるグローバルに特有なアクターを表します、それはさまざまな宣言をどこでもプログラムの中で分離するために使用できます。

source: A type that represents a position in the collection.
ja: コレクションの中のある位置を表す型。

source: A type that represents a string literal.
ja: ある文字列リテラルを表す型。

source: A type that represents a valid position in the collection.
ja: 有効な位置をそのコレクションにおいて表している型。

source: A type that represents an extended grapheme cluster literal.
ja: 拡張書記素クラスタリテラルを表すある型。

source: A type that represents an integer literal.
ja: ある整数リテラルを表す型。

source: A type that represents the distance between two values.
ja: ２つの値の間の隔たりを表す型。

source: A type that represents the encoded exponent of a value.
ja: ある値のエンコードされた指数を表す型。

source: A type that represents the encoded significand of a value.
ja: ある値のエンコードされた仮数を表す型。

source: A type that represents the indices that are valid for subscripting the collection, in ascending order.
ja: 昇順での、コレクションの添え字として有効なインデックスを表す型。

source: A type that represents the words of a binary integer.
ja: あるバイナリ整数の単語を表す型。

source: A type that represents the words of this integer.
ja: この整数のワードを表す型。

source: A type that supplies a custom description for playground logging.
ja: プレイグラウンドログのためにあつらえの記述を提供する型。

source: A type to compare.
ja: 比較する型。

source: A type whose instances can be encoded, and appropriately passed, as elements of a C va_list.
ja: それのインスタンスが、符号化されること、そして適切に渡されることが、C va_listの要素として可能である型。

source: A type with a customized textual representation suitable for debugging purposes.
ja: デバッグ目的に都合がよいようにカスタマイズされた原文の表現を持つ型。

source: A type with a customized textual representation.
ja: カスタマイズされた原文の表現を持つ型。

source: A type with values that support addition and subtraction.
ja: 加算と減算をサポートする値を持つ型。

source: A type with values that support multiplication.
ja: 乗算をサポートする値をもつ型。

source: A type-erased hashable value.
ja: 型消去ハッシュ可能値。

source: A type-erased iterator of Element.
ja: Elementの型消去イテレータ。

source: A type-erased key path, from any root type to any resulting value type.
ja: 型消去キーパス、何らかの根本の型から何らかの結果値の型への。

source: A type-erased sequence.
ja: 型消去シーケンス。

source: A type-erased wrapper over any collection with indices that support bidirectional traversal.
ja: ２方向に辿っていくことをサポートするインデックスを持つあらゆるコレクションを覆う型消去ラッパー。
